emdzej/bimmerz-box/firmware/sdkconfig.defaults
# Bimmerz Box — base sdkconfig defaults.
#
# Board-specific overrides live in sdkconfig.defaults.waveshare and
# sdkconfig.defaults.dongle and are layered on top of this file at
# configure time.

CONFIG_IDF_TARGET="esp32p4"

# ---- PSRAM (32 MB octal, soldered) ----------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024

# ---- Flash + partition table ----------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ---- ESP32-P4 cache + XIP (matches Waveshare example baseline) -------------
# ESP-Hosted's SDIO timing on this board appears sensitive to these.
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- Bootloader / OTA -----------------------------------------------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_ESP_TASK_WDT_INIT=y

# ---- Logging --------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# ---- FreeRTOS -------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ---- Networking placeholders (filled in by wifi_ap component later) -------
CONFIG_LWIP_LOCAL_HOSTNAME="bimmerz-box"

# ---- Filesystem -----------------------------------------------------------
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# ---- HTTP server ----------------------------------------------------------
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# ---- LWIP sockets --------------------------------------------------------
# Default is 10; we raised httpd `max_open_sockets` to 13 (see
# http_static.c) so multiple concurrent apps (ediabasx / inpax / ncsx /
# nfsx / dashx / settings-UI keep-alive) don't starve the accept queue.
# 16 gives httpd room + a few slots for admin-UI static asset fetches
# alongside the WS pool. Each socket costs ~2 KB of LWIP state on
# ESP32-P4, so this is well within the 32 MB PSRAM budget.
CONFIG_LWIP_MAX_SOCKETS=16

# ---- LWIP TCP window -----------------------------------------------------
# Defaults are 5760 B (4 × MSS), which throttles large JSON-RPC responses
# (FA reads, full SGBD listings) hard — the server stalls waiting for ACKs
# on every 4-segment window. 14400 B (10 × 1440 MSS) keeps the pipe full
# on the AP-local link without burning much RAM (10 KB per direction
# × max_open_sockets).
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=14400
CONFIG_LWIP_TCP_WND_DEFAULT=14400

# ---- Compiler -------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
